app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Checkign create"], ["created_at", "2014-07-18 02:35:58.082684"], ["title", "check-create"], ["updated_at", "2014-07-18 02:35:58.082684"]]
---
	def create
		@article = Article.new(article_params)
		@article.save