app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["author_name", "Anvesh"], ["body", "I am a baba"], ["created_at", "2014-07-18 08:59:59.371021"], ["updated_at", "2014-07-18 08:59:59.371021"]]
---
	def create
		@comment= Comment.new(comment_params)
		@comment.article_id = params[:article_id]

		@comment.save